<?php

namespace Database\Seeders;

use App\Models\Genre;
use Illuminate\Database\Seeder;

class GenreSeeder extends Seeder
{
    public function run(): void
    {
        $genres = [
            "Поп-музыка", 
            "Рок-музыка", 
            "Хип-хоп", "Электронная музыка", 
            "Кантри", "Джаз", "Блюз", 
            "Классическая музыка", 
            "Регги", "Металл", "Фолк", "Инди-рок", 
            "Панк-рок", "Соул", "Фанк", "Рэп", "Техно", 
            "Хаус", "Транс", "Дабстеп", "Диско", "Клубная музыка", 
            "Нью-эйдж", "Босса-нова", "Латиноамериканская музыка", 
            "Рэггетон", "Ска", "Альтернативный рок", "Гранж", "Инди-поп", 
            "Классический рок", "Классический джаз", "Акустическая музыка", 
            "Инструментальная музыка", "Нью-рейв", "Эмбиент", "Нойз", "Авангардная музыка", 
            "Экспериментальная музыка", "Индустриальная музыка", "Готическая музыка", "Симфонический металл", 
            "Прогрессивный металл", "Дум-металл", "Альтернативный металл", "Пост-рок",];

        foreach($genres as $genre){
            Genre::firstOrCreate([
                'name' => $genre,
            ]);
        }
    }
}
